# YOLOv5 🚀 by Ultralytics, GPL-3.0 license

# Parameters
nc: 80  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 6, C3, [256]],  #% 4- P3/8
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],  #% 6- P4/16
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 3, C3, [1024]], #% 8- P5/32
   [-1, 1, SPPF, [1024, 5]],  # 9
  ]

# YOLOv5 v6.0 head
head:
  [[[4,6,8,9], 1, YoloSegTower, [[320,640,1280,1280] ,320, 320]],  #10
   [-1, 1, Conv, [256,1,1]],   #11- seg to (P3/8)
   [-1, 1, Conv, [256,3,2]],   #12- seg to (P4/16)
   [-1, 1, Conv, [256,3,2]],   #13- seg to (P5/32)
    
   [9, 1, Conv, [512, 1, 1]],   #% 14   --to P5/32
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],  #15
   [[-1, 6], 1, Concat, [1]],  #16 cat backbone P4
   [-1, 3, C3, [512, False]],  #17

   [-1, 1, Conv, [256, 1, 1]],  #% 18   --to P4/16
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], # 19
   [[-1, 4], 1, Concat, [1]],  # 20 cat backbone P3
   [[-1, 11], 1, Concat, [1]], # 21 cat seg feat P3
   [-1, 1, Conv, [512, 1, 1]], # 22
   [-1, 3, C3, [256, False]],  #% 23 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]], #24
   [[-1, 18], 1, Concat, [1]], #25 cat head P4
   [[-1, 12], 1, Concat, [1]], #26 cat seg feat P4
   [-1, 1, Conv, [512, 1, 1]], #27 
   [-1, 3, C3, [512, False]],  #% 28 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]], #29
   [[-1, 14], 1, Concat, [1]],  #30 cat head P5
   [[-1, 13], 1, Concat, [1]], #31 cat seg feat P5
   [-1, 1, Conv, [1024, 1, 1]], #32
   [-1, 3, C3, [1024, False]],  #% 33 (P5/32-large)

   [10, 1, SegHead, [320, 81]],          #34
   [[23,28,33], 1, YoloSegTower, [[320,640,1280] ,320, 320]],  #35
   [-1, 1, SegHead, [320, 81]],                    #36
   [[23, 28, 33], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]